def main():
    ox = int(input("Введите координату Х "))
    oy = int(input("Введите координату У "))
    if ox > 0 and oy > 0:
        print(f"Точка с координатами {ox, oy} принадлежит 1-ой четверти")
    elif ox < 0 < oy:
        print(f"Точка с координатами {ox, oy} принадлежит 2-ой четверти")
    elif ox < 0 and oy < 0:
        print(f"Точка с координатами {ox, oy} принадлежит 3-ой четверти")
    else:
        print(f"Точка с координатами {ox, oy} принадлежит 4-ой четверти")


if __name__ == "__main__":
    main()
